"""
Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

Примечание. Высота и ширина прямоугольника равны 4 и 17 звёздочкам соответственно.
"""

print(f"{'*' * 17}\n*{' '* 15}*\n*{' '* 15}*\n{'*' * 17}")
