"""
Как известно, целые числа в языке Python не имеют ограничений, которые встречаются в других языках программирования.
Напишите программу, которая считывает четыре целых положительных числа a, b, c, d и выводит на экран значение выражения
a^b + c^d.

Формат входных данных
На вход программе подаётся четыре целых положительных числа a, b, c, d, каждое на отдельной строке в указанном порядке.

Формат выходных данных
Программа должна вывести значение ab+cda^b + c^dab+cd.
"""

print(int(input()) ** int(input()) + int(input()) ** int(input()))
