"""
Напишите программу, которая выводит указанный треугольник, состоящий из звездочек (*).
"""

print('\n'.join(['*' * i for i in range(1, 8)]))
