"""
Входные данные
На вход программе подаётся три целых числа: a1, d и n, каждое на отдельной строке.

Выходные данные
Программа должна вывести n n n-ый член арифметической прогрессии.
"""

print(int(input()) + int(input()) * (int(input()) - 1))
