"""
Напишите программу, которая принимает целое число xxx и определяет, принадлежит ли данное число указанным промежуткам.

Формат входных данных
На вход программе подаётся целое число xxx.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
"""

print("Принадлежит" if -1 < int(input()) < 17 else "Не принадлежит")
