"""
Назовем число красивым, если оно является четырехзначным и делится нацело на 7 или на 17. Напишите программу,
определяющую, является ли введённое число красивым. Программа должна вывести «YES», если число является красивым,
или «NO» в противном случае.

Формат входных данных
На вход программе подаётся натуральное число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
"""

num = int(input())
print("YES" if (num // 1000) in range(1, 10) and ((num % 7 == 0) or (num % 17 == 0)) else "NO")
