"""
Входные данные
На вход программе подаётся три целых числа: b1, q и n каждое на отдельной строке.

Выходные данные
Программа должна вывести n n n-ый член геометрической прогрессии.
"""

print(int(input()) * int(input()) ** (int(input()) - 1))
