"""
Напишите программу для нахождения цифр четырёхзначного числа.

Формат входных данных
На вход программе подаётся положительное четырёхзначное целое число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
"""

digit = input()
print(f"Цифра в позиции тысяч равна {digit[0]}\nЦифра в позиции сотен равна {digit[1]}\nЦифра в позиции десятков равна {digit[2]}\nЦифра в позиции единиц равна {digit[3]}")
